‎module.exports.config = {
‎ name: "rules2",
‎ version: "1.0.0",
‎ hasPermssion: 0,
‎ credits: "Shahadat Islam",
‎ description: "Send group rules",
‎ commandCategory: "information",
‎ usages: "rules2",
‎ cooldowns: 5
‎};
‎
‎module.exports.run = async ({ api, event }) => {
‎ const message = `❐-আসসালামু আলাইকুম,🖤🌺
‎❐- 𝙶𝚁𝙾𝚄𝙿 এর কিছু 𝚁𝚄𝙻𝙴𝚂 আছে, এগুলো হয়তো অনেকেই জানেন না যারা জানেন না তারা জেনে রাখেন⬅️
‎<------------------------------------------------->
‎
‎০১) আজেবাজে খারাপ কথা বলা যাবে না ! ⚠️
‎০২) কাউকে অপমান কিংবা গালাগালি করা যাবে না ! ⚠️
‎০৩) অপ্রয়োজনীয় ট্যাগ বা সবাইকে বারবার mention করা যাবে না ! 🚫
‎০৪) মেয়েদের কে, তার পারমিসন ছাড়া ইনবক্স মেসেজ দেওয়ার চেষ্টা করলে সরাসরি রিমুভ ✅
‎০৫) অশ্লীল ছবি/ভিডিও/মিম শেয়ার করলে ব্যান খাবেন ⚡
‎০৬) নিজের ইউটিউব/পেজের লিংক দিয়ে স্প্যাম করলে KICK 🦵
‎০৭) অ্যাডমিনদের সম্মান করতে হবে 🛡️
‎০৮) কোনো ধর্ম বা জাতি নিয়ে কটাক্ষ করা যাবে না ❌
‎০৯) ভুয়া নিউজ/গুজব ছড়ালে রিপোর্ট + ব্লক 🚨
‎১০) রাত ১২টার পর শুধু ভদ্র ভাষায় মজা করা যাবে, অশ্লীলতা নয় 😌
‎
‎<------------------------------------------------->
‎❖ কারও সমস্যা থাকলে সরাসরি 𝙰𝙳𝙼𝙸𝙽𝚂 দের ইনবক্স করুন 💌
‎❖ রুলস ভাঙলে আগে ওয়ার্নিং, পরে অ্যাকশন 😈
‎
‎𝙱𝙾𝚃 𝙰𝙳𝙼𝙸𝙽: 𝐒𝐢𝐭𝐡𝐢𝐥 𝐀𝐡𝐦𝐞𝐝 𝐒𝐡𝐚𝐤𝐢𝐛
‎𝙵𝙱 𝙻𝙸𝙽𝙺: https://www.facebook.com/AhmedSithiL007?mibextid=ZbWKwL
‎
‎_সাথেই থাকুন 🌺─꯭─⃝‌‌𝐒𝐢𝐭𝐡𝐢𝐥 𝐚𝐡𝐦𝐞𝐝 𝐒𝐡𝐚𝐤𝐢𝐛🌸_
‎
‎💖...........ধন্যবাদ সবাইকে...........💖`;
‎
‎ return api.sendMessage(message, event.threadID);
‎};
